[
  {
    "file": "Conc/Conc.jsx",
    "route": "/conclusion",
    "content": "H1: Conclusion L'atténuation de l'utilisation des dark patterns repose sur plusieurs stratégies clés,\n              dont la sensibilisation des entreprises. En théorie, des formations et des campagnes\n              de sensibilisation sur les impacts négatifs des dark patterns sur les utilisateurs\n              devraient conduire à une prise de conscience des entreprises."
  },
  {
    "file": "Def/Def.jsx",
    "route": "/definition-identification",
    "content": "H1: Définition et identification Qu'est-ce que c'est ?\n            \n              N’avez vous jamais trouvé compliqué de se désabonner d’un service ou d’un abonnement\n              sur Internet ? De commander un produit sans être assailli d’autres offres “exclusives”\n              avec l’intention de toujours vous faire dépenser plus ? Ou encore le jour où vous avez\n              voulu profiter d’une période d’essai gratuite avant de vous faire débiter car aucune\n              notification ne vous a été envoyée pour vous informer de la reconduction de\n              l’abonnement ?\n            \n            \n              Évidemment que cela vous est déjà arrivé, ça nous arrive à tous. Que ce soit une\n              personne âgée perdue sur le web ou le développeur le plus aguerri, nous sommes tous\n              victimes de nos propres biais et de la façon dont ils sont exploités par de nombreuses\n              entreprises.\n            \n            \n              \n              \n                Introduits en 2010 par Harry Brignull, un spécialiste UX, les dark patterns,\n                également appelés les Deceptive Patterns représentent des interfaces conçues\n                délibérément pour tromper ou manipuler les utilisateurs. Pourquoi on les utilise\n            \n              On pourrait se demander pourquoi mettre en place ces interfaces trompeuses ? En\n              réalité le raisonnement des entreprises est simple : ça fonctionne et ça rapporte.\n              Donc, tant qu’on ne se fait pas prendre, on continue. C’est la principale raison pour\n              laquelle les dark patterns sont essentiellement exploités sur les sites et\n              applications avec un traffic massif.\n            \n            \n              Pour détailler un peu plus ce point, voilà quelques raisons spécifiques pour\n              lesquelles les dark patterns sont utilisés :\n            \n            \n              \n                 Augmentation du taux de conversion : rendre un\n                processus d’achat rapide et ultra-simple tout en poussant à l’achat impulsif\n              \n              \n                Réduction des désabonnements : en mettant en place des\n                labyrinthe administratifs comme cité plus haut\n              \n              \n                Maximisation des profits : ajouter des produits non\n                désirés au panier ou en cachant des frais jusqu’à la dernière étape du paiement\n              \n            \n            \n              En bref, le principal but des sites et applications qui se servent des dark patterns\n              et mercantile. Nudge ou dark pattern ?\n            \n              Rappelons d’abord ce qu’est un nudge (ou coup de coude) : un outil de “suggestion”\n              disposé dans notre environnement, supposé nous aider à faire les bons choix, dans\n              notre intérêt ou celui de la société\n            \n            \n              Si les nudges et les dark patterns sont similaires dans leur mise en place, leurs\n              objectifs sont pourtant diamétralement opposés. Comme nous l’avons vu précédemment, le\n              but du dark pattern est d’induire en erreur un utilisateur pour le pousser à faire un\n              choix non réfléchi, parfois même contre sa volonté. Le nudge quant à lui incite les\n              individus à adopter un comportement ou faire certains choix mais sans mettre de\n              contrainte, d’obligation ou de menace de sanction. Et là est toute la différence.\n            \n            \n              Pour résumer, un nudge vise à améliorer le bien-être de l'individu ou de la société en\n              encourageant des comportements positifs.\n            \n            \n              Il pourrait par exemple être utilisé pour inciter les gens à manger plus sainement en\n              plaçant des fruits et légumes à hauteur des yeux dans un supermarché.\n            \n            \n              En revanche, les dark patterns cherchent à manipuler l'utilisateur à des fins souvent\n              financières ou commerciales, en profitant de ses biais cognitifs."
  },
  {
    "file": "Home/Home.jsx",
    "route": "/",
    "content": "H1: Dark patterns"
  },
  {
    "file": "Law/Law.jsx",
    "route": "/defis-ethiques",
    "content": "H1: Défis éthiques Consentement des utilisateurs\n\n            \n              “Cliquez ici pour accepter nos termes d’utilisation”, “Cochez cette case pour accepter\n              notre newsletter”, “Acceptez-vous les cookies sur notre site ?” Des phrases que nous\n              avons tous lues et relues sans cesse sur internet au cours des dernières années. Ces\n              messages sont devenus omniprésents, dans le simple but d’obtenir le consentement des\n              utilisateurs pour diverses actions, de l'acceptation des cookies à l'abonnement à des\n              services.\n            \n            \n              Le consentement des utilisateurs est un enjeu éthique majeur car il doit être éclairé,\n              volontaire et explicite. Cependant, les dark patterns compromettent souvent ces\n              critères. Par exemple, les informations importantes sont souvent masquées ou écrites\n              dans un langage juridique complexe, rendant difficile la compréhension par les\n              utilisateurs de ce à quoi ils consentent vraiment. Des pratiques comme l’utilisation\n              de longues conditions générales remplies de jargon sont courantes, empêchant une\n              compréhension claire et complète.\n            \n            \n              Si ces pratiques semblent de prime abord être de bonnes initiatives pour les\n              utilisateurs, elles résultent en réalité pour la plupart d’obligations légales,\n              principalement en Union Européenne grâce à la Réglementation Générale sur la\n              Protection des Données (RGPD) Cadre légal\n            \n            \n              Au fil du temps et des actions en justice, les législations et régulations évoluent\n              pour lutter contre les pratiques de dark patterns et protéger les droits des\n              utilisateurs :\n            \n            RGPD\n            \n              En Europe depuis 2018, le RGPD impose des règles\n              strictes sur la collecte et l’utilisation des données personnelles des utilisateurs.\n              Il exige un consentement explicite et{\" \"}\n              éclairé des utilisateurs avant toute utilisation de\n              leurs données. Ainsi, les entreprises doivent pouvoir fournir des informations claires\n              et accessibles sur la manière dont les données sont stockées et traitées. Les\n              utilisateurs doivent pouvoir à tout moment{\" \"}\n              retirer leur consentement et avoir un droit de regard\n              sur leurs données personnelles.\n            \n            DMA\n            \n              Le DMA, ou Digital Markets Act a pour objectif de créer\n              un environnement numérique plus équitable et transparent\n              . Elle insiste sur l’importance de posséder une{\" \"}\n              concurrence loyale via des obligations. Il interdit par\n              ailleurs certaines pratiques de dark patterns, comme les mécanismes de consentement\n              trompeurs et les interfaces utilisateur manipulatrices."
  },
  {
    "file": "Soluce/Soluce.jsx",
    "route": "/solutions",
    "content": "H1: Solutions envisagées Atténuer leur utilisation\n            Sensibilisation des entreprises\n            \n              L'atténuation de l'utilisation des dark patterns repose sur plusieurs stratégies clés,\n              dont la sensibilisation des entreprises. En théorie, des formations et des campagnes\n              de sensibilisation sur les impacts négatifs des dark patterns sur les utilisateurs\n              devraient conduire à une prise de conscience des entreprises.\n            \n            \n              Cependant, il serait naïf de croire que cette seule sensibilisation suffira à résoudre\n              le problème. Bien que certaines entreprises puissent effectivement modifier leurs\n              pratiques, une majorité pourrait continuer à privilégier les gains à court terme au\n              détriment de l'expérience utilisateur éthique.\n            \n            \n              Cette situation souligne la nécessité d'une approche multidimensionnelle, combinant\n              sensibilisation, réglementation et sanctions économiques, pour véritablement atténuer\n              l'utilisation des dark patterns.\n            \n            Conception éthique\n            \n              La conception éthique semble être une solution prometteuse pour lutter contre les dark\n              patterns. Il est essentiel de repenser en profondeur notre approche du design (UI et\n              UX), en replaçant l'utilisateur et son bien-être au centre des préoccupations.\n            \n            Sanctions économiques\n            \n              Enfin, la mise en place de sanctions constitue un levier puissant pour dissuader\n              l'utilisation des dark patterns. Il est donc nécessaire d'imposer un cadre légal\n              renforcé, s'inspirant des réglementations existantes comme le RGPD ou le DMA, mais\n              spécifiquement ciblé sur les dark patterns. Les sanctions doivent être suffisamment\n              dissuasives pour avoir un réel impact, avec par exemple des amendes proportionnelles\n              au chiffre d'affaires des entreprises fautives. Au-delà des pénalités financières,\n              l'obligation de rectification des interfaces dans un délai imparti sous peine de\n              sanctions supplémentaires augmenterait l'effet dissuasif. La mise en place de\n              mécanismes de signalement accessibles aux utilisateurs permettrait également une\n              détection plus rapide et efficace des pratiques abusives. La lutte contre les dark patterns exige une approche holistique, combinant prévention,\n              éducation et répression. Elle nécessite une collaboration étroite entre les\n              entreprises, les designers, les régulateurs et les utilisateurs eux-mêmes."
  },
  {
    "file": "Study/Study.jsx",
    "route": "/etude-cas-exemples",
    "content": "H1: Étude de cas et exemples Le cas Amazon Prime\n            \n            \n              Nous connaissons tous au moins une personne, un proche ou un collègue ayant\n              malencontreusement souscrit à un abonnement Amazon Prime sans réellement le désirer.\n            \n            \n              Amazon propose régulièrement une période d'essai gratuite pour Prime, attirant les\n              utilisateurs avec des avantages attrayants qui, de prime abord sont sans frais.\n              Cependant, aucune notification explicite n’est envoyée à la fin de la période d'essai,\n              ce qui pousse les utilisateurs à reconduire leur abonnement sans réelle volonté ed le\n              faire, à moins qu'ils n'annulent leur abonnement à temps. Cette pratique tire parti de\n              l'inattention ou de l'oubli des utilisateurs.\n            \n            Processus d'abonnement\n            Léa, ayant souscrit sans le vouloir à Amazon Prime nous dit : \n            Processus de désabonnement\n            \n              Le processus de désabonnement d'Amazon Prime est notoirement complexe. Les\n              utilisateurs doivent naviguer à travers plusieurs pages pour pouvoir espérer résilier\n              leur abonnement. À chaque étape des messages encouragent les utilisateurs à\n              reconsidérer leur décision, mettant en avant les avantages qu'ils perdraient en\n              annulant l'abonnement. Des boutons primaires, bien visibles pour conserver\n              l'abonnement sont placés stratégiquement et bien en vue, tandis que les options de\n              désabonnement sont moins visibles et nécessitent plus de clics. Ce qui n’est pas sans\n              nous rappeler la loi de de Fitts.\n            \n            \n              L’UFC que choisir s’était d’ailleurs penchée sur le sujet et suite à une action en\n              lien avec le Bureau européen des Unions de Consommateurs contre les obstacles au\n              désabonnement d’Amazon Prime, la société se met enfin en conformité avec le droit\n              européen.\n            \n            \n              \n              \n                {\" \"}\n                Le piège à utilisateur supprimé ! - Billet de la présidente - UFC-Que Choisir\n              \n              www.quechoisir.org\n            \n            \n              L'exemple d'Amazon Prime illustre comment les entreprises peuvent utiliser des dark\n              patterns pour maximiser leurs profits, souvent au détriment de la transparence et de\n              la satisfaction des utilisateurs. Pour maintenir la confiance des utilisateurs, il est\n              essentiel que les entreprises simplifient les processus de désabonnement et\n              fournissent des informations claires et accessibles sur les conditions des\n              abonnements. Exemples concrets\n            \n              Penchons nous maintenant sur d’autres exemples plus brefs, mais tout aussi\n              intéressants. Liste de la honte\n            \n              Pour illustrer l'ampleur du problème des dark patterns et identifier les acteurs\n              majeurs qui y ont recours, examinons la \"Liste de la honte\". Cette liste, compilée à\n              partir de diverses sources et rapports, met en lumière les entreprises les plus\n              fréquemment citées pour leur utilisation de dark patterns. Le chiffre entre\n              parenthèses indique le nombre de fois où l'entreprise a été signalée pour des\n              pratiques douteuses. Cette liste nous permet de constater que même les géants de la\n              technologie et des médias sociaux, malgré leurs ressources et leur influence, ne sont\n              pas exempts de ces pratiques manipulatrices. Il est important de noter que cette liste\n              est dynamique et évolue au fil du temps, reflétant les changements dans les pratiques\n              des entreprises et la vigilance croissante des utilisateurs et des régulateurs."
  },
  {
    "file": "Vul/Vul.jsx",
    "route": "/vulnerabilites-psychologiques",
    "content": "H1: Vulnérabilités psychologiques Biais et vulnérabilités\n            \n              \n                “People behave more on the basis of how they feel than how they think; unless there\n                are good feelings between people, it is almost impossible to reason intelligently.“ Lois UX\n            \n              Pour comprendre encore mieux comment ces comportements sont induits, évoquons\n              maintenant quelques lois fondamentales d’UX Design. Ces lois sont des principes\n              utilisés par les designers pour créer des interfaces efficaces, intuitives et\n              agréables. Cependant, ces mêmes lois peuvent être détournées pour créer des dark\n              patterns, exploitant ainsi les biais cognitifs et comportementaux des utilisateurs.\n            \n\n            \n              \n                Loi de Fitts\n                \n                  Indique que les utilisateurs peuvent maintenir environ sept éléments (plus ou\n                  moins deux) dans leur mémoire de travail. Impact psychologique\n            \n              Les dark patterns ont des conséquences psychologiques significatives, dépassant la\n              simple frustration momentanée. Leur utilisation répandue engendre une méfiance\n              générale envers les technologies numériques, créant un sentiment de perte de contrôle\n              et d'impuissance chez les utilisateurs. Cette manipulation constante peut affecter\n              l'estime de soi, particulièrement lorsque les utilisateurs réalisent avoir été\n              trompés. Cela peut conduire à une réticence à explorer de nouvelles technologies,\n              limitant ainsi leurs opportunités dans un monde numérique en expansion. De plus, en\n              exploitant les vulnérabilités psychologiques, ces pratiques peuvent exacerber les\n              comportements addictifs, impactant négativement la santé mentale. Les populations\n              vulnérables, comme les personnes âgées ou celles ayant une faible littératie\n              numérique, sont particulièrement à risque.\n            \n            \n              En somme, les dark patterns ne se contentent pas de manipuler ponctuellement ; ils\n              façonnent durablement la relation des utilisateurs avec la technologie, affectant leur\n              confiance et leur bien-être émotionnel."
  }
]
